"""
디지털 시계에 하루동안(00:00~23:59) 3이 표시되는 시간을 초로 환산하면 총 몇 초(second) 일까요?
디지털 시계는 하루동안 다음과 같이 시:분(00:00~23:59)으로 표시됩니다.
"""
sum = 0
for h in range(24):
    for m in range(60):
        print("{0:02d}:{1:02d}".format(h, m), end=" ")
        if str(h).find("3") != -1 or str(m).find("3") != -1:
            sum += 60
            print("{0}".format(sum), end=" ")
        print()
print(sum)  # 29700

"""result
00:00 
00:01 
00:02 
00:03 60 
00:04 
00:05 
00:06 
00:07 
00:08 
00:09 
00:10 
00:11 
00:12 
00:13 120 
00:14 
00:15 
00:16 
00:17 
00:18 
00:19 
00:20 
00:21 
00:22 
00:23 180 
00:24 
00:25 
00:26 
00:27 
00:28 
00:29 
00:30 240 
00:31 300 
00:32 360 
00:33 420 
...
23:57 29580 
23:58 29640 
23:59 29700 
29700
"""